#include <iostream>
using namespace std;

// 어셈블리 언어 입문

 
// 데이터 기초

// 비트와 바이트
// 
// 비트는 0 과 1만 가질 수 있는 단위
// 바이트 = 8비트
// 
//    0 0 0 0 0 0 0 0 > 바이트(8비트)
// 가장 왼쪽은 음수부호(값도 가지고 음수를 만드는 역할도 한다)
// 시작자리값은 1이고 왼쪽으로 갈수록 2배씩 증가
// 
// HEX  16진수    0 1 2 3 4 5 6 7 8 9 A B C D E F 10 11 12 13 ~ (0x00)
// DEC  10진수    0 1 2 3 4 5 6 7 8 9 10 11 12 ~ 
// OCT  8진수
// BIN  2진수     0 1 10 11 100 101 110 111 1000 1001 ~ (0b00)
//
// * 2진수를 4개씩 끊어서 읽으면 16진수로 바꾸기 편하다.
//   0b10101101 > 1010 / 1101  > 0xAD
//
// * 2의 보수 > 01010110(86) 을 부호만 바꾸려면 10101001 로 바꾼 후 +1 해주면 되므로 10101010 이 -86이다
//























